onemonthrails/graftucson/app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 07 Nov 2013 23:57:06 UTC +00:00], ["description", "Cool beasers"], ["updated_at", Thu, 07 Nov 2013 23:57:06 UTC +00:00], ["user_id", 3]]

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = 10